ErpTest/src/InformationRegisters/пкРезервТехники/пкРезервТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пкРезервТехники</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Резерв</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗаявкаНаАрендуТехники</name>
    <type>
      <types>DocumentRef.пкЗаявкаНаАрендуТехники</types>
    </type>
  </resources>
  <dimensions>
    <name>Техника</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/Enums/пкВидыОперацийЗаданийНаПеревозку/пкВидыОперацийЗаданийНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>пкВидыОперацийЗаданийНаПеревозку</name>
  <enumValues>
    <name>ДоставкаКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>Перекат</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеМеждуРегионами</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Enums/пкОперацииПогрузкаВыгрузка/пкОперацииПогрузкаВыгрузка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>пкОперацииПогрузкаВыгрузка</name>
  <enumValues>
    <name>Погрузка</name>
  </enumValues>
  <enumValues>
    <name>Выгрузка</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Documents/пкЗаданиеНаПеревозку/пкЗаданиеНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>пкЗаданиеНаПеревозку</name>
  <basedOn>Catalog.ОбъектыЭксплуатации</basedOn>
  <basedOn>Document.пкЗаданиеНаПеревозку</basedOn>
  <registerRecords>InformationRegister.пкСтатусыТехники</registerRecords>
  <registerRecords>InformationRegister.пкСрокиАренды</registerRecords>
  <registerRecords>InformationRegister.пкРезервТехники</registerRecords>
  <registerRecords>AccumulationRegister.пкМоделиКДоставкеПоЗаявкамНаАрендуТехники</registerRecords>
  <registerRecords>AccumulationRegister.пкТехникаКПеремещениюМеждуРегионами</registerRecords>
  <registerRecords>InformationRegister.пкДатыАренды</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.пкВидыОперацийЗаданийНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаАрендуТехники</name>
    <type>
      <types>DocumentRef.пкЗаявкаНаАрендуТехники</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Техника</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>РегионПолучатель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.пкЗаданиеНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>Ответственный за доставку</comment>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.пкСтатусыЗаданийНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаменаТехники</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАренды</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьЗаказНарядНаОсмотр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаПодтверждена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбоснованиеПодтверждения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КтоПодтвердил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КПроверке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтвержденоКлиентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийВодителю</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Повреждена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Повреждения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

ErpTest/src/InformationRegisters/пкРезервТехники/ManagerModule.bsl
/////////////////////////////////////////////////////////////////////////

Процедура СформироватьЗаписиПоДокументуЗаданиеНаПеревозку(Отказ, РежимПроведения, тИсточник)
	
	НаборЗаписей  = тИсточник.Движения.пкРезервТехники;
	НаборЗаписей.Записывать = Истина;
	
	Если ЗначениеЗаполнено(тИсточник.Техника) Тогда
		
		Если тИсточник.ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.ДоставкаКлиенту
			ИЛИ тИсточник.ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.ПеремещениеМеждуРегионами Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Регистратор				= тИсточник.Ссылка;
			НоваяЗапись.Период					= тИсточник.ДатаОтгрузки;//Мин(тИсточник.Дата, ?(ЗначениеЗаполнено(тИсточник.ДатаОтгрузки), тИсточник.ДатаОтгрузки, тИсточник.Дата));
			
			НоваяЗапись.Техника					= тИсточник.Техника;
			НоваяЗапись.Резерв					= Истина;
			
			НоваяЗапись.ДатаОтгрузки	 		= тИсточник.ДатаОтгрузки;
			НоваяЗапись.ЗаявкаНаАрендуТехники	= тИсточник.ЗаявкаНаАрендуТехники;
		КонецЕсли;
	КонецЕсли;

	Попытка
		НаборЗаписей.Записать(Истина);
	Исключение
		Отказ = Истина;
		тСообщение = Новый СообщениеПользователю;
		тСообщение.Текст = ОписаниеОшибки();
		тСообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры

Процедура СформироватьЗаписиПоДокументуПогрузкаВыгрузкаПоДоставке(Отказ, РежимПроведения, тИсточник)
	
	НаборЗаписей  = тИсточник.Движения.пкРезервТехники;
	НаборЗаписей.Записывать = Истина;
	
	Если тИсточник.Операция = Перечисления.пкОперацииПогрузкаВыгрузка.Погрузка тогда
		
		Если тИсточник.ЗаданиеНаПеревозку.ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.Перекат Тогда
			Если НЕ ЗначениеЗаполнено(тИсточник.ЗаданиеНаПеревозку.ЗаданиеНаПеревозку) Тогда
				Если ЗначениеЗаполнено(тИсточник.ЗаданиеНаПеревозку.Техника) Тогда
					
					ЗаявкаПолучатель = тИсточник.ЗаданиеНаПеревозку.ЗаявкаНаАрендуТехники;
					
					ЗапросЗадания = Новый Запрос;
					ЗапросЗадания.Текст = 
					"ВЫБРАТЬ
					|	пкЗаданиеНаПеревозку.Ссылка
					|ИЗ
					|	Документ.пкЗаданиеНаПеревозку КАК пкЗаданиеНаПеревозку
					|ГДЕ
					|	пкЗаданиеНаПеревозку.Проведен
					|	И пкЗаданиеНаПеревозку.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозку
					|	И НЕ пкЗаданиеНаПеревозку.ПометкаУдаления";
					ЗапросЗадания.УстановитьПараметр("ЗаданиеНаПеревозку", тИсточник.ЗаданиеНаПеревозку);
					ЗавершающиеЗадания = ЗапросЗадания.Выполнить().Выбрать();
					Если ЗавершающиеЗадания.Следующий() Тогда
						ЗаявкаПолучатель = ЗавершающиеЗадания.Ссылка.ЗаявкаНаАрендуТехники;
					КонецЕсли;
					
					//1. Статус ВПути до выгрузки
					НоваяЗапись = НаборЗаписей.Добавить();
					НоваяЗапись.Регистратор				= тИсточник.Ссылка;
					НоваяЗапись.Период					= тИсточник.Дата;
					
					НоваяЗапись.Техника					= тИсточник.ЗаданиеНаПеревозку.Техника;
					НоваяЗапись.Резерв					= Истина;
					
					НоваяЗапись.ДатаОтгрузки	 		= "";
					НоваяЗапись.ЗаявкаНаАрендуТехники	= ЗаявкаПолучатель;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли тИсточник.Операция = Перечисления.пкОперацииПогрузкаВыгрузка.Выгрузка тогда
		
		Если (тИсточник.ЗаданиеНаПеревозку.ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.ДоставкаКлиенту
				ИЛИ тИсточник.ЗаданиеНаПеревозку.ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.ПеремещениеМеждуРегионами)
		Тогда
		
			Если ЗначениеЗаполнено(тИсточник.ЗаданиеНаПеревозку.Техника) Тогда
				
				//1. Статус ВПути закончен
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Регистратор				= тИсточник.Ссылка;
				НоваяЗапись.Период					= тИсточник.Дата;
				
				НоваяЗапись.Техника					= тИсточник.ЗаданиеНаПеревозку.Техника;
				НоваяЗапись.Резерв					= Ложь;
				
				НоваяЗапись.ДатаОтгрузки	 		= "";
				НоваяЗапись.ЗаявкаНаАрендуТехники	= тИсточник.ЗаданиеНаПеревозку.ЗаявкаНаАрендуТехники;
				
			КонецЕсли;
			
		ИначеЕсли тИсточник.ЗаданиеНаПеревозку.ВидОперации = Перечисления.пкВидыОперацийЗаданийНаПеревозку.Перекат Тогда
			Если ЗначениеЗаполнено(тИсточник.ЗаданиеНаПеревозку.ЗаданиеНаПеревозку) Тогда
				Если ЗначениеЗаполнено(тИсточник.ЗаданиеНаПеревозку.Техника) Тогда
					
					//1. Статус ВПути на дату документа при выгрузке
					НоваяЗапись = НаборЗаписей.Добавить();
					НоваяЗапись.Регистратор				= тИсточник.Ссылка;
					НоваяЗапись.Период					= тИсточник.Дата;
					
					НоваяЗапись.Техника					= тИсточник.ЗаданиеНаПеревозку.Техника;
					НоваяЗапись.Резерв					= Ложь;
					
					НоваяЗапись.ДатаОтгрузки	 		= "";
					НоваяЗапись.ЗаявкаНаАрендуТехники	= тИсточник.ЗаданиеНаПеревозку.ЗаявкаНаАрендуТехники;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		НаборЗаписей.Записать(Истина);
	Исключение
		Отказ = Истина;
		тСообщение = Новый СообщениеПользователю;
		тСообщение.Текст = ОписаниеОшибки();
		тСообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////
Процедура СформироватьЗаписи(Отказ, РежимПроведения, тИсточник) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	МассивИсточников = Новый Массив;
	
	Если ТипЗнч(тИсточник) = Тип("Массив") Тогда
		МассивИсточников = тИсточник;
	Иначе
		МассивИсточников.Добавить(тИсточник);
	КонецЕсли;
	
	Для Каждого ЭлементИсточник из МассивИсточников Цикл
		
		Если ТипЗнч(ЭлементИсточник) = Тип("ДокументОбъект.пкЗаданиеНаПеревозку") Тогда
			СформироватьЗаписиПоДокументуЗаданиеНаПеревозку(Отказ, РежимПроведения, ЭлементИсточник);
		ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ДокументОбъект.пкПогрузкаВыгрузкаПоДоставке") Тогда
			СформироватьЗаписиПоДокументуПогрузкаВыгрузкаПоДоставке(Отказ, РежимПроведения, ЭлементИсточник);
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры
